// 1. написать программу в которой пользователя просят ввести числа 5 раз
// причем каждое последующее должно быть больше ПРЕДЫДУЩЕГО
// если пользователь нарушил это правило то прекратить ввод и вывести алертом
// сообщение об ошибке
// если все 5 чисел были больше предыдущего вывести алертом сообщение об суспехе

// let currenUserNumber;
// let previosUserNumber = +prompt('введите число');
// for (let i = 1; i <= 5; i++) {
//     currenUserNumber = +prompt('введите число');
     
//     if (currenUserNumber < previosUserNumber) {
//         alert("ошибка");
//         break
//     } 
//     previosUserNumber = currenUserNumber;
//     if (i === 5){
//     alert("успех");
//     break
//     }
// }

// 2. написать программу заику, пользователь вводит число
// вывести в консоль столько "за" скоклько ввел пользователь
// например пользователь вводит 3
// вывод в консоли "зазазаика"

// let userNumber = +prompt('введите число');
// let zaika = '';
// let text = "ика"
// for (let i = 0; i < userNumber; i++) {
//     // zaika = zaika + 'za';
//     zaika = `${zaika}за`;    
//     console.log(zaika + text);    
// }

// 1. пользователь вводит число n (положительное), вывести на экран
// все четные числа от 1 до n
// let n = +prompt('введите число');
// for (let i = 1; i <= n; i++) {
//     if (i % 2 === 0) {
//       console.log(i);  
//     }    
// }

// 2. создать переменную password = '1234' (правильный пароль)
// просим пользователя ввести пароль, до тех пор пока он не введет правильный  
// если пользователь нажал "отмена" прекратить ввод

// let password = '1234';
// for (let i = 0; ; i++) {
//     let enterPassword = prompt('enter Password');
//     if (enterPassword === password) {
//         console.log('Ok');
//         break
//     }
//     if (enterPassword === null) {
//         console.log('отмена');
//         break
//     }
// }

// 3. пользователь вводит свой текущий возраст,
// вывести в консоль сколько лет ему будут каждый год до 2030 года
// пример: пользователь вводит 14
// выводим: в 2023 году будет 15
// в 2024 году будет 16
// в 2025 году будет 17
// ....
// в 2030 году будет 23

// let userAge = +prompt('введите свой возраст');
// for (let i = 2022; i <= 2030; i++) {
//     console.log(`в ` + i + ` году будет ` + userAge);
//     ++userAge;
// }

// 4. пользователь вводит год своего рождения
// вывести в консоль сколько лет ему было каждый год до текущего
// пример: пользователь водит 2000
// вывод: в 2001 было 1 год
// в 2002 было 2 год
// ...
// в 2022 было 22 год

// let year = +prompt('введите год своего рождения');
// let num = 0;
// for (let i = year; i <= 2022; i++) {
//     console.log(`в ` + i + ` году Вам было ` + num + ` лет`);
//     ++num;
// }


// 3. написать игру. Под диваном живет 100 хомячков, пользователь
// не знает сколько их. Задача пользователя доставать из под дивана хомячков 
// до тех пор, пока их там не останется.
// В конце игры выводим количество попыток за которое пользователь достал
// всех хомячков.
// Если пользователь нажмет "отмена" игра должна прекратиться досрочно
// с выводом сообщения чз алерт.
// Если пользователь пытается достать хомячков больше чем их осталось под 
// диваном то вывести алертом сообщение "нет столько хомячков".

// let homjak = 100;
// for (let i = 1; ; i++) {
//    let num = prompt('сколько хомячков живет под диваном');
//     if (+num === homjak) {
//         console.log('Вы угадали');
//         console.log(i);
//         break
//     } else if (+num > homjak) {
//         console.log('нет столько хомячков');
//     } else if (+num < homjak) {       
//         console.log('есть еще хомячки, сколько еще?');
//         homjak = homjak - +num;        
//     } else if (+num === null) {
//         console.log('отмена');    
//         break
//     }
    
// }



// 4. Написать игру камень ножницы бумага
// игра до 10 побед пользователя либо компа ( при победе выводим имя победителя )
// пользователь должен вводить "камень" "ножницы" либо "бумага"
// компьютер должен рандомно генерировать "камень" "ножницы" либо "бумага"
// после чего выводим сообщение вида
// "вы выиграли ваш выбор: камень, выбор компа: "ножницы""
// и засчитываем очко соответствующему игроку, после чего начинаем следующий раунд
// при ничьей, очко никому не засчитываем