// const p1 = 'John';
// const p2 = 'Valera';
// const p3 = 'Vova';
// const p4 = 'Oleg';
// const p5 = 'Gleb';

// const team = ['John', 'Valera', 'Vova', 'Oleg', 'Gleb'];
// // const player = team[1];
// // console.log(player);
// // console.log(team.length);
// team[0] = 'Evlampij';
// console.log(team);
// const team2 = new Array('John', 'Valera', 'Vova', 'Oleg', 'Gleb');

// const someArr = [];
// const userInput = 35;
// someArr.length = userInput;

// const team = ['John', 'Valera', 'Vova', 'Oleg', 'Gleb'];
// // console.log(team[team.length - 1]);
// // team[team.length] = 'Mitrofan';
// // console.log(team);
// for (let i = 0; i < team.length; i++) {
//     console.log(`Mr. ${team[i]}`);
//     if (team[i] === 'Vova') {
//         team[i] = 'Alex';
//         console.log(team);
//     }      
// }

// 1. дан массив из 10 чисел. Вывести в консоль сумму всех элементов массива
// const arr = [55, 2, 43, 6, 5, 16, 7, 38, 9, 320];
// let sum = 0;
// for (let i = 0; i < arr.length; i++) {
//     sum += arr[i]
//     console.log(sum);
// }

// 2. найти среднее арифметическое всех элементов массива, которые стоят на четных местах (0,2,4...)
// const arr = [2, 5, 6, 8, 13, 11, 19];
// let sum = 0;
// let average = 0;
// for (let i = 0; i < arr.length; i++) {
//     if (i % 2 === 0) {
//         sum += arr[i];
//         average++;
//        
//     }    
// }
//  console.log(sum / average);


// 3. дан исходный массив [2,-65,7,-1,26,48,-93,58,9] 
// создать новый массив, элементы которого противоположны по знакам исходного
// const arr = [2,-65,7,-1,26,48,-93,58,9];
// const arr2 = [];
// for (let i = 0; i < arr.length; i++) {
//
//         arr2[i] = -arr[i];
//  
// }
//     console.log(arr);
//     console.log(arr2);

// 4. создать пустой массив длиной 10
// автоматически заполнить массив нулями и единицами, начиная с единицы
// const arr = [];
// for (let i = 0; i < 10; i++) {
//     if (i % 2 === 0) {
//        arr[i] = 1;
//     }
//     if (i % 2 !== 0) {
//        arr[i] = 0;
//     }
//     console.log(arr);
// }

// 5. заполнить массив последовательными нечетными числами (длина 10)
const arr = [];
for (let i = 0; i < 10; i++) {   
    arr[0] = 1;
    arr[i] = i + 2;
    
} console.log(arr);

// 6. с помощью цикла создать массив, каждый элемент которого равен
// квадрату своего номера (длина 10)
// 7. дан массив 10 чисел. вывести в консоль количество четных
// элементов из этого массива
// 8. дан массив 10 чисел. вывести наибольшее число из этого массива//

// 9. дан массив из 10 случайных чисел (НЕ ПОСЛЕДОВАТЕЛЬНЫХ)
// найдите количество элементов массива, которые отличны от наибольшего 
// не больше чем на 10%
// 10. дан массив из 10 случайных чисел (НЕ ПОСЛЕДОВАТЕЛЬНЫХ)
// выведите на экран наибольший ЧЕТНЫЙ элемент массива
// 11. дан массив из 10 случайных чисел (НЕ ПОСЛЕДОВАТЕЛЬНЫХ)
// пользователь вводит число n, вывести в консоль элемент массива
// который наиболее близок к n (если таких элементов несколько, вывести несколько)
